# we start with standard command line utilities
brew 'coreutils'
brew 'tmux'
brew 'readline'
brew 'tree'
brew 'htop'
brew 'wget'
brew 'z'
brew 'lbzip2'
brew 'unrar'

# programming languages
brew 'python3'
brew 'mit-scheme'
brew 'haskell'
brew 'rust'
brew 'erlang'

# network stuff
brew 'nmap'
brew 'links'
brew 'elinks'

# dev tools
brew 'capstone'
brew 'hub'
brew 'heroku'
brew 'docker'
brew 'doxygen'
brew 'phantomjs'
brew 'webkit2png'
brew 'pngcrush'
brew 'imagemagick'
brew 'ack'
brew 'the_silver_searcher'
brew 'peco'

# various and sundry
brew 'pandoc'
brew 'hugo'
brew 'lame'
brew 'youtube-dl'
brew 'speedtest-cli'
brew 'trash'
brew 'gnupg'
brew 'keybase'
brew 'ntfs-3g'
cask 'homebrew/games/nethacked'
brew 'fontforge'
brew 'imgcat'


# now getting into full macOS apps
cask_args appdir: '/Applications'
tap 'caskroom/cask'

# infrastructure
cask 'dropbox'
cask '1password'
cask 'google-drive'

# internet
cask 'firefox'
cask 'google-chrome'
cask 'transmit'
cask 'slack'
cask 'adium'
cask 'transmission'

# writing and office
cask 'scrivener'
cask 'marked'
cask 'libreoffice'
cask 'nvalt'

# development
  # one of these days I really need to settle on a text editor
cask 'sublime-text'
cask 'atom'
cask 'visual-studio-code'
cask 'kaleidoscope'
cask 'github-desktop'
cask 'sqlelectron'
cask 'origami'
cask 'xquartz'

# artsy
cask 'unity'
cask 'blender'
cask 'inkscape'
cask 'sketchup'
cask 'skitch'

# various virtualization thingies
cask 'vmware-fusion'
cask 'virtualbox'
cask 'vagrant'

# entertainment
cask 'steam'
cask 'gog-downloader'
cask 'dwarf-fortress-lnp'
cask 'boxer'
cask 'handbrake'
cask 'vlc'

# utilities
cask 'iterm2'
cask 'hammerspoon'
cask 'go2shell'
cask 'the-unarchiver'
cask 'disk-inventory-x'
cask 'flux'
cask 'spectacle'
cask 'itsycal'
cask 'cheatsheet'

# quicklook stuff
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'suspicious-package'


# and finally, stuff from the Mac App Store
brew 'mas'

# development
mas 'Xcode',              id: 497799835
mas 'Base',               id: 402383384
mas 'Soulver',            id: 413965349

# internet
mas 'Tweetbot',           id: 557168941

# graphics and office
mas 'Pixelmator',         id: 407963104
mas 'Affinity Designer',  id: 824171161
mas 'Pages',              id: 409201541
mas 'Numbers',            id: 409203825
mas 'Keynote',            id: 409183694
