# zsh and standard command line utilities
brew 'zsh'
brew 'coreutils'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'tree'
brew 'htop'
brew 'z'
brew 'p7zip'
brew 'lbzip2'
brew 'unrar'

# programming languages
brew 'python3'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'mit-scheme'
brew 'rust'
brew 'haskell-stack'
brew 'elm'

# network stuff
brew 'wget'
brew 'nmap'
brew 'arm'
brew 'links'
brew 'elinks'

# dev tools
brew 'git'
brew 'git-lfs'
brew 'git-cal'
brew 'tig'
brew 'cmake'
brew 'automake'
brew 'clang-format'
brew 'swig'
brew 'hub'
brew 'heroku'
brew 'doxygen'
brew 'phantomjs'
brew 'httpie'
brew 'webkit2png'
brew 'pngcrush'
brew 'pngquant'
brew 'zopfli'
brew 'imagemagick'
brew 'ghostscript'
brew 'sassc'
brew 'ack'
brew 'the_silver_searcher'
brew 'peco'

# various and sundry
brew 'pandoc'
brew 'multimarkdown'
brew 'hugo'
brew 'lame'
brew 'libdvdcss'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'libav'
brew 'speedtest-cli'
brew 'dieharder'
brew 'dockutil'
brew 'trash'

# amusements!
brew 'nethack'
brew 'frotz'


# now getting into full macOS apps
tap 'caskroom/cask'

# infrastructure
cask 'dropbox'
cask '1password'
cask 'google-drive'

# internet
cask 'firefox'
cask 'google-chrome'
cask 'torbrowser'
cask 'tunnelbear'
cask 'transmit'
cask 'slack'
cask 'gitter'
cask 'transmission'

# writing and office
cask 'scrivener'
cask 'libreoffice'

# development
cask 'sublime-text'
cask 'visual-studio-code'
cask 'macdown'
cask 'arduino'
cask 'processing'
cask 'kaleidoscope'
cask 'github-desktop'
cask 'sourcetree'
cask 'postman'
cask 'sqlectron'
cask 'robomongo'
cask 'xquartz'
cask 'dotnet'
cask 'mono-mdk'

# artsy
cask 'unity'
cask 'unity-standard-assets'
cask 'unity-webgl-support-for-editor'
cask 'unity-ios-support-for-editor'
cask 'unity-windows-support-for-editor'
cask 'unity-linux-support-for-editor'
cask 'blender'
cask 'tiled'
cask 'bfxr'
cask 'twine'
cask 'inkscape'
cask 'sketchup'
cask 'nodebox'
cask 'fontforge'

# various virtualization thingies
cask 'vmware-fusion'
cask 'virtualbox'
cask 'vagrant'
cask 'docker'

# entertainment
cask 'steam'
cask 'gog-galaxy'
cask 'battle-net'
cask 'itch'
cask 'dwarf-fortress'
cask 'minecraft'
cask 'boxer'
cask 'snes9x'
cask 'handbrake'
cask 'vlc'

# utilities
cask 'iterm2'
cask 'keybase'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'scroll-reverser'
cask 'ubersicht'
cask 'arq'
cask 'etcher'
cask 'the-unarchiver'
cask 'omnidisksweeper'
cask 'selfcontrol'
cask 'aerial'

# quicklook stuff
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'suspicious-package'


# a few monospaced fonts from caskroom
#   (others handled outside of script)
tap  'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-hack'


# drivers
tap  'caskroom/drivers'
cask 'xbox360-controller-driver'


# and finally, stuff from the Mac App Store
brew 'mas'

# development
mas 'Xcode',              id: 497799835
mas 'Base',               id: 402383384
mas 'Soulver',            id: 413965349

# internet
mas 'Tweetbot',           id: 557168941

# media
mas 'Kindle',             id: 405399194
mas 'GarageBand',         id: 682658836

# graphics and office
mas 'Pixelmator',         id: 407963104
mas 'Affinity Designer',  id: 824171161
mas 'Pages',              id: 409201541
mas 'Numbers',            id: 409203825
mas 'Keynote',            id: 409183694
mas 'GIF Brewery 3',      id: 1081413713
