# zsh and standard command line utilities
brew 'zsh'
brew 'coreutils'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'tree'
brew 'htop'
brew 'z'
brew 'p7zip'
brew 'lbzip2'
brew 'unrar'
brew 'unar'
brew 'gnupg'
brew 'xz'

# meta environments
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'nodenv'
brew 'node-build'
# brew 'rustup-init' # installed in provision-mac.sh

# programming languages
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'mit-scheme'
brew 'ghc'
brew 'cabal-install'
brew 'haskell-stack'
brew 'go'
brew 'deno'

# network stuff
brew 'wget'
brew 'nmap'
brew 'tor'
brew 'elinks'

# dev tools
brew 'git'
brew 'git-lfs'
brew 'cmake'
brew 'automake'
brew 'clang-format'
brew 'swig'
brew 'ctags'
brew 'valgrind'
brew 'qcachegrind'
brew 'hub'
brew 'libyaml'
brew 'travis'
brew 'ripgrep'
brew 'jq'
brew 'sqlite'
brew 'flatbuffers'

# cask tools
tap 'vitorgalvao/tiny-scripts'
brew 'cask-repair'

# graphics tools
brew 'imagemagick'
brew 'ghostscript'
brew 'pdf2svg'
brew 'svg2png'
brew 'woff2'
brew 'pngcrush'
brew 'pngquant'
brew 'zopfli'
brew 'guetzli'
brew 'gifski'

# various and sundry
brew 'pandoc'
brew 'multimarkdown'
brew 'lame'
brew 'libdvdcss'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'libav'
brew 'speedtest-cli'
brew 'dieharder'
brew 'dockutil'
brew 'duti'
brew 'trash'

# amusements!
brew 'nethack'
brew 'frotz'
brew 'solarus'


# now getting into full macOS apps
tap 'caskroom/cask'
tap 'caskroom/versions'

# infrastructure
cask '1password'
cask 'dropbox'
cask 'backblaze'

# internet
cask 'firefox'
cask 'google-chrome'
cask 'tor-browser'
cask 'transmit'
cask 'transmission'

# writing and office
cask 'scrivener'
cask 'microsoft-office'

# development
cask 'sublime-text'
cask 'visual-studio-code'
cask 'dash'
cask 'macdown'
cask 'processing'
cask 'kaleidoscope'
cask 'sourcetree'
cask 'insomnia'
cask 'robo-3t'

# programming languages
cask 'dotnet-sdk'
cask 'mono-mdk'
cask 'rstudio'

# artsy
cask 'unity-hub'
cask 'godot'
cask 'blender'
cask 'texturepacker'
cask 'bfxr'
cask 'twine'
cask 'nodebox'

# various virtualization thingies
cask 'vmware-fusion'
cask 'virtualbox'
cask 'docker'

# entertainment
cask 'itch'
cask 'gog-galaxy'
cask 'epic-games'
cask 'discord'
cask 'steam'
cask 'dwarf-fortress'
cask 'handbrake'
cask 'vlc'
cask 'mpv'
cask 'amazon-music'
cask 'calibre'
cask 'cloudlibrary'

# utilities
cask 'hammerspoon'
cask 'arq'
cask 'the-unarchiver'
cask 'selfcontrol'
cask 'balenaetcher'
cask 'unetbootin'
cask 'mkvtoolnix'
cask 'keepingyouawake'

# quicklook stuff
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'suspicious-package'
# cask 'qlimagesize'


# a few monospaced fonts from caskroom
#   (others handled outside of script)
tap  'caskroom/fonts'
cask 'font-inconsolata'
cask 'font-hack'


# drivers
tap  'caskroom/drivers'
# cask 'xbox360-controller-driver-unofficial'


# and finally, stuff from the Mac App Store
brew 'mas'

# development
mas 'Xcode',              id: 497799835
mas 'Base',               id: 402383384
mas 'Soulver',            id: 413965349
mas 'Calca',              id: 635758264

# internet
mas 'Tweetbot',           id: 557168941

# media
mas 'Kindle',             id: 405399194
mas 'GarageBand',         id: 682658836

# utility
mas 'GrandPerspective',   id: 1111570163
mas 'TickTick',           id: 966085870

# graphics and office
# mas 'Pixelmator',         id: 407963104
mas 'Pixelmator Pro',     id: 1289583905
mas 'Affinity Designer',  id: 824171161
mas 'Highland 2'          id: 1171820258
# mas 'Pages',              id: 409201541
# mas 'Numbers',            id: 409203825
mas 'Keynote',            id: 409183694
mas 'GIF Brewery 3',      id: 1081413713
mas 'GIPHY Capture',      id: 668208984
