# shells and standard command line utilities
brew 'fish'
brew 'zsh'
brew 'bash'
brew 'coreutils'
brew 'parallel'
brew 'pv'
brew 'direnv'
brew 'tree'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'htop'
brew 'mactop'
brew 'eza'
brew 'bat'

# compression stuffs
brew 'zlib'
brew 'p7zip'
brew 'lbzip2'
brew 'unar'
brew 'gnupg'
brew 'xz'
brew 'brotli'
brew 'pigz'
brew 'gnu-tar'
brew 'sevenzip'

# programming languages
## ones I actually use
brew 'python'
brew 'python-setuptools'
brew 'virtualenv'
# brew 'uv' # for Python, someday
brew 'node'
brew 'pnpm'
brew 'deno'
# brew 'rustup-init' # installed in provision-mac.sh
brew 'go'
brew 'zig'
brew 'r'
brew 'ruby'
brew 'php' # look, i'm not proud of it, but
brew 'composer'
brew 'nasm'
brew 'wabt'
brew 'wasmtime'

## don't really use, but needed for other things
brew 'openjdk'

## ones I keep meaning to learn
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'ghc'
brew 'cabal-install'
brew 'haskell-stack'
brew 'haxe'

# network stuff
brew 'wget'
brew 'aria2'
brew 'nmap'
brew 'tcptraceroute'
brew 'tor'
brew 'felinks'
brew 'openconnect'
brew 'xxhash'
brew 'telnet'

# dev tools
## text editors
##   in general I am not smart enough for non-gui editors but
##      I keep intending to learn one of these days
brew 'vim'
brew 'neovim'
brew 'helix'
brew 'nano'
brew 'emacs'
brew 'micro'

## source control
brew 'git'
brew 'git-lfs'
brew 'git-filter-repo'
brew 'hub'
brew 'gh'
brew 'bfg'
brew 'jj'
brew 'mercurial'
brew 'subversion'
brew 'fossil'

## build systems and tools
brew 'cmake'
brew 'scons'
brew 'meson'
brew 'ninja'
brew 'automake'
brew 'mingw-w64'
brew 'emscripten'
brew 'clang-format'
brew 'swiftformat'
brew 'swift-format'
brew 'cocoapods'
brew 'stylua'
brew 'swig'
brew 'ctags'
brew 'qcachegrind'
brew 'yasm'
brew 'flatbuffers'
brew 'cloc'
brew 'scc'
brew 'dprint'

## gcc versions so I can test stuff out
brew 'gcc'
brew 'gcc@11'
brew 'gcc@12'
brew 'gcc@13'
brew 'gcc@14'

## virtualization
brew 'qemu'
brew 'podman'
brew 'docker'
brew 'colima'

## search and store
brew 'ripgrep'
brew 'jq'
brew 'yq'
brew 'htmlq'
brew 'sqlite'
brew 'sqlite-utils'
brew 'testdisk'

# graphics tools
brew 'imagemagick', link: false
brew 'imagemagick-full', link: true
brew 'exiftool'
brew 'ghostscript'
brew 'jpeg'
brew 'pdf2svg'
brew 'svg2png'
brew 'librsvg'
brew 'cpdf'
brew 'mupdf-tools'
brew 'diff-pdf'
brew 'woff2'
brew 'pngcrush'
brew 'pngquant'
brew 'jpegoptim'
brew 'zopfli'
brew 'guetzli'
brew 'mozjpeg'
brew 'gifski'
brew 'gifsicle'
brew 'svgo'

# various and sundry
brew 'pandoc'
brew 'typst'
brew 'multimarkdown'
brew 'epubcheck'
brew 'ocrmypdf'
brew 'verapdf'
brew 'lame'
brew 'libdvdcss'
brew 'yt-dlp'
brew 'gallery-dl'
brew 'ffmpeg', link: false,
brew 'ffmpeg-full', link: true,
brew 'yap'
brew 'speedtest-cli'
# brew 'dieharder'  # removed from homebrew? :(
brew 'dockutil'
brew 'defaultbrowser'
brew 'duti'
brew 'trash'
brew 'entr'
brew 'm1ddc'
brew 'hyperfine'
brew 'gnu-units'
brew 'imessage-exporter'

# amusements!
brew 'nethack'
brew 'frotz'
brew 'solarus'
brew 'mame'
brew 'rom-tools'
brew 'stockfish'

# my own tools
brew 'sjml/sjml/beschi'
brew 'sjml/sjml/paper'
brew 'sjml/sjml/secure-pbcopy'
brew 'sjml/sjml/hdr-resize'


# now getting into full macOS apps
tap 'homebrew/cask'

# infrastructure
cask '1password'
cask '1password-cli'
# cask 'backblaze' # don't use homebrew for this; upgrade will bork things
cask 'backblaze-downloader'
cask 'little-snitch'
cask 'mullvad-vpn'

# internet
cask 'firefox'
cask 'chromium'
cask 'google-chrome'
cask 'orion'
cask 'tor-browser'

cask 'transmit'
cask 'cyberduck'
cask 'transmission'
cask 'jdownloader'

cask 'whatsapp'
cask 'telegram'
cask 'signal'
cask 'zoom'
cask 'webex'
cask 'discord'
cask 'slack'
cask 'microsoft-teams'

# writing and office
cask 'scrivener'
cask 'microsoft-office'
cask 'zotero'
cask 'anki'
cask 'skim'

# development
cask 'visual-studio-code'
cask 'sublime-text'
cask 'zerobranestudio'
cask 'processing'

cask 'github'
cask 'sourcetree'

cask 'dash'
cask 'kaleidoscope@2'
cask 'hex-fiend'
cask 'httpie-desktop'

cask 'postgres-unofficial'
cask 'base'

cask 'sf-symbols'

# programming languages
cask 'dotnet-sdk'
cask 'rstudio'
cask 'julia-app'
cask 'powershell'

# artsy/media
# cask 'godot' # manually install godot to control versioning
# cask 'godot-mono'
cask 'blender'
cask 'blockbench'
cask 'dust3d'
cask 'freecad'
cask 'affinity-designer'
cask 'inkscape'
cask 'fontforge'
cask 'krita'
cask 'texturepacker'
cask 'tiled'
cask 'pixelorama'
cask 'audacity'
cask 'losslesscut'
cask 'twine-app'
cask 'inky'
cask 'nodebox'
cask 'obs'
cask 'shotcut'


# various virtualization thingies
cask 'multipass'
cask 'utm'
# cask 'vmware-fusion' # probably dead?
# cask 'virtualbox' # no arm support
# cask 'crossover' # mostly have windows machines to do windows things
# cask 'docker' # slow and bulky; probably don't need the desktop version

# entertainment
cask 'itch'
cask 'gog-galaxy'
cask 'epic-games'
cask 'steam'
cask 'nvidia-geforce-now'
cask 'whisky'

cask 'minecraft'
cask 'marathon'
cask 'marathon-2'
cask 'marathon-infinity'

cask 'handbrake-app'
cask 'iina'
cask 'vlc'
# cask 'mpv' # renamed to something scary, but not really using anyway
cask 'calibre'
cask 'yacreader'
cask 'adobe-digital-editions'

# utilities
cask 'hammerspoon'
# cask 'arq' # kinda aggro; look again later
cask 'the-unarchiver'
cask 'selfcontrol'
cask 'time-out'
cask 'balenaetcher'
cask 'unetbootin'
cask 'mkvtoolnix-app'
cask 'keepingyouawake'
cask 'a-better-finder-rename'
cask 'pastebot'
cask 'crunch-app'
cask 'sloth'
cask 'betterzip'

# quicklook stuff
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'suspicious-package'
cask 'qlcolorcode'
cask 'qlvideo'
cask 'apparency'


# a few monospaced fonts from caskroom
#   (others handled outside of script)
cask 'font-fira-code'
cask 'font-juliamono'


# my own apps
cask 'sjml/sjml/dotfile-watcher'
cask 'sjml/sjml/dualcam'


# and finally, stuff from the Mac App Store
brew 'mas'

# development
mas 'Xcode',               id: 497799835
mas 'Calca',               id: 635758264
mas 'Ultra Character Map', id: 520265986
mas 'WorldWideWeb',        id: 1621370168

# internet
# mas 'Messenger',           id: 1480068668 # (discontinued)
mas 'Discovery',           id: 1381004916
mas 'WireGuard',           id: 1451685025

# media
# mas 'GarageBand',          id: 682658836 # (takes up too much space)
mas 'iMovie',              id: 408981434
mas 'Overcast',            id: 888422857
mas 'Kindle',              id: 302584613

# utility
mas 'GrandPerspective',    id: 1111570163
mas 'Menu World Time',     id: 1446377255
# mas 'EasyRes',             id: 688211836 # discontinued? :(
mas 'Shareful',            id: 1522267256
mas 'Discovery',           id: 1381004916
mas 'Notchmeister',        id: 1599169747
mas 'HazeOver'             id: 430798174

# graphics and office
mas 'Pixelmator Pro',      id: 1289583905
# mas 'GIF Brewery 3',       id: 1081413713 # discontinued? :(
mas 'Gifski',              id: 1351639930
mas 'Gapplin',             id: 768053424
mas 'GIPHY Capture',       id: 668208984
mas 'Pages',               id: 409201541
mas 'Numbers',             id: 409203825
mas 'Keynote',             id: 409183694
# mas 'Highland 2',          id: 1171820258 # discontinued? :(
