13xforever.language-x86-64-assembly
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alexcvzz.vscode-sqlite
amodio.tsl-problem-matcher
bibhasdn.unique-lines
bungcip.better-toml
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.githistory
dotiful.dotfiles-syntax-highlighting
DotJoshJohnson.xml
doublebuffer.metal-shader
dtsvet.vscode-wasm
eamodio.gitlens
EditorConfig.EditorConfig
elmTooling.elm-ls-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.code-runner
gaborv.flatbuffers
geequlim.godot-tools
golang.go
hbenl.vscode-test-explorer
JakeBecker.elixir-ls
julialang.language-julia
Kelvin.vscode-sshfs
mechatroner.rainbow-csv
mhutchie.git-graph
Mrmomo.meson-build
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.cpptools
ms-vscode.hexeditor
ms-vscode.mono-debug
ms-vscode.test-adapter-converter
nisargjhaveri.ios-debug
rebornix.ruby
redhat.vscode-yaml
REditorSupport.r
ronnidc.nunjucks
rust-lang.rust
ShaneLiesegang.csl-json-citation-picker
ShaneLiesegang.vscode-simple-icons-rev
skyapps.fish-vscode
slevesque.shader
sswg.swift-lang
stevensona.shader-toy
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tiehuis.zig
torn4dom4n.latex-support
twxs.cmake
Tyriar.lorem-ipsum
vadimcn.vscode-lldb
wholroyd.jinja
wingrunr21.vscode-ruby
xdebug.php-debug
yzhang.markdown-all-in-one
