13xforever.language-x86-64-assembly
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alexcvzz.vscode-sqlite
alfish.godot-files
amodio.tsl-problem-matcher
andrejunges.handlebars
battlelinegames.assemblyscript-lang
bibhasdn.unique-lines
bierner.markdown-mermaid
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
dberezin.lox-language
deerawan.vscode-dash
denoland.vscode-deno
donjayamanne.githistory
dotiful.dotfiles-syntax-highlighting
dotjoshjohnson.xml
doublebuffer.metal-shader
dtsvet.vscode-wasm
eamodio.gitlens
editorconfig.editorconfig
elmtooling.elm-ls-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.code-runner
gaborv.flatbuffers
geequlim.godot-tools
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
haskell.haskell
hbenl.vscode-test-explorer
idleberg.applescript
idleberg.jxa
jakebecker.elixir-ls
justusadam.language-haskell
llvm-vs-code-extensions.lldb-dap
mariomatheu.syntax-project-pbxproj
mechatroner.rainbow-csv
mhutchie.git-graph
mrmlnc.vscode-apache
mrmomo.meson-build
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.mono-debug
ms-vscode.test-adapter-converter
ms-vscode.wordcount
myriad-dreamin.tinymist
oscarotero.vento-syntax
redhat.vscode-yaml
ronnidc.nunjucks
rust-lang.rust-analyzer
shaneliesegang.csl-json-citation-picker
shaneliesegang.vscode-simple-icons-rev
sissel.shopify-liquid
skyapps.fish-vscode
slevesque.shader
stevensona.shader-toy
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-spanish
svelte.svelte-vscode
swiftlang.swift-vscode
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tomoki1207.pdf
torn4dom4n.latex-support
twxs.cmake
tyriar.lorem-ipsum
vadimcn.vscode-lldb
webfreak.debug
wholroyd.jinja
wisim3000.djot-marker
xdebug.php-debug
yzhang.markdown-all-in-one
ziglang.vscode-zig
