13xforever.language-x86-64-assembly
akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alexcvzz.vscode-sqlite
amodio.tsl-problem-matcher
bibhasdn.unique-lines
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.githistory
dotiful.dotfiles-syntax-highlighting
dotjoshjohnson.xml
doublebuffer.metal-shader
dtsvet.vscode-wasm
eamodio.gitlens
editorconfig.editorconfig
elmtooling.elm-ls-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.code-runner
gaborv.flatbuffers
geequlim.godot-tools
github.vscode-github-actions
golang.go
hbenl.vscode-test-explorer
idleberg.applescript
jakebecker.elixir-ls
julialang.language-julia
kelvin.vscode-sshfs
mariomatheu.syntax-project-pbxproj
mechatroner.rainbow-csv
mhutchie.git-graph
mrmomo.meson-build
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.mono-debug
ms-vscode.test-adapter-converter
ms-vscode.wordcount
nisargjhaveri.ios-debug
redhat.vscode-yaml
reditorsupport.r
ronnidc.nunjucks
rust-lang.rust-analyzer
shaneliesegang.csl-json-citation-picker
shaneliesegang.vscode-simple-icons-rev
shopify.ruby-lsp
skyapps.fish-vscode
slevesque.shader
sswg.swift-lang
stevensona.shader-toy
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tamasfe.even-better-toml
tomoki1207.pdf
torn4dom4n.latex-support
twxs.cmake
tyriar.lorem-ipsum
vadimcn.vscode-lldb
wholroyd.jinja
wingrunr21.vscode-ruby
xdebug.php-debug
yzhang.markdown-all-in-one
ziglang.vscode-zig
